let map = {
    role: {
        1: '学生',
        2: '家长',
        4: '教师',
        8: '校长'
    },
    phase: {
        0: '小学',
        1: '初中',
        2: '高中'
    },
    subject: {
        1: '校长问卷(系统默认)',
        2: '教师基本信息问卷(系统默认)',
        3: '班主任问卷',
        4: '品德与社会教师问卷',
        5: '科学教师问卷',
        6: '物理教师问卷',
        7: '生物教师问卷',
        8: '地理教师问卷',
        9: '思想品德教师问卷',
        10: '科学(自然)教师问卷',
        11: '体育教师问卷',
        12: '数学教师问卷',
        13: '学生问卷',
        14: '家长问卷',
        15: '语文教师问卷',
        16: '音乐教师问卷',
        17: '美术教师问卷'
    },
    primarySubject: {
        1: '校长问卷(系统默认)',
        2: '教师基本信息问卷(系统默认)',
        3: '班主任问卷',
        4: '品德与社会教师问卷',
        10: '科学(自然)教师问卷',
        11: '体育教师问卷',
        12: '数学教师问卷',
        13: '学生问卷',
        14: '家长问卷',
        15: '语文教师问卷',
        16: '音乐教师问卷',
        17: '美术教师问卷'
    },
    juniorSubject: {
        1: '校长问卷(系统默认)',
        2: '教师基本信息问卷(系统默认)',
        3: '班主任问卷',
        5: '科学教师问卷',
        6: '物理教师问卷',
        7: '生物教师问卷',
        8: '地理教师问卷',
        9: '思想品德教师问卷',
        11: '体育教师问卷',
        12: '数学教师问卷',
        13: '学生问卷',
        14: '家长问卷',
        15: '语文教师问卷',
        16: '音乐教师问卷',
        17: '美术教师问卷'
    },
    seniorSubject: {
        1: '校长问卷(系统默认)',
        2: '教师基本信息问卷(系统默认)',
        3: '班主任问卷',
        5: '科学教师问卷',
        6: '物理教师问卷',
        7: '生物教师问卷',
        8: '地理教师问卷',
        9: '思想品德教师问卷',
        11: '体育教师问卷',
        12: '数学教师问卷',
        13: '学生问卷',
        14: '家长问卷',
        15: '语文教师问卷',
        16: '音乐教师问卷',
        17: '美术教师问卷'
    }
};
export default map;